test-perf/artillery.yml
config:
  target: "http://78.46.40.15/v1"
  http:
    timeout: 240
  processor: "./artillery-custom-logic.cjs"

  phases:
    - name: "POST measurement"
      duration: "{{ $processEnvironment.DURATION }}"
      arrivalRate: "{{ $processEnvironment.RPS }}"

scenarios:
  - name: "Ping 100 probes"
    flow:
      - post:
          url: "/measurements"
          json:
            target: "google.com"
            type: "ping"
            measurementOptions:
              packets: 16
            limit: "{{ $processEnvironment.LIMIT }}"
            locations: []
          capture:
            json: "$.id"
            as: "id"
      - think: 3
      - loop:
          - think: 1
          - get:
              url: "/measurements/{{ id }}"
              capture:
                - json: $.status
                  as: "status"
        whileTrue: "statusFinished"